Revit 2027 API
BumpMap.TextureOffsetLock Property
 The property labeled "Offset Lock" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureOffsetLock { get; }
Public Shared ReadOnly Property TextureOffsetLock As String
	Get
public:
static property String^ TextureOffsetLock {
	String^ get ();
}
static member TextureOffsetLock : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace